# Лабораторная 8.Бирюкова Мария.
# Задание.1
countries = {
    "Россия": "Москва",
    "Франция": "Париж",
    "Германия": "Берлин",
    "Италия": "Рим",
    "Япония": "Токио",
    "Китай": "Пекин",
    "Испания": "Мадрид"
}
print("Все пары страна-столица:")
for country, capital in countries.items():
    print(f'{country} — {capital}')

country_inp = input("\nВведите название страны, чтобы узнать её столицу: ")
capital = countries.get(country_inp, 'не найдена')
print(f'Столица страны {country_inp}: {capital}')

print("Содержимое словаря в алфавитном порядке названий стран:")
for country in sorted(countries):               # sorted() создаёт временный список, но не сохраняет
    print(f'{country} — {countries[country]}')

# Задание.2
# Стоимость букв
points = {
    'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 'С': 1, 'Т': 1,
    'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2,
    'Б': 3, 'Г': 3, 'Ё': 3, 'Ь': 3, 'Я': 3,
    'Й': 4, 'Ы': 4,
    'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5,
    'Ш': 8, 'Э': 8, 'Ю': 8,
    'Ф': 10, 'Щ': 10, 'Ъ': 10
}

word = input('Введите слово: ').upper()
total = 0
for letter in word:
    if letter in points:
        total += points[letter]

print(f'Стоимость слова "{word}": {total} очков.')